
## Plan Result (terraform/main)

[CI link](https://github.com/kaz-under-the-bridge/my-cloud-iac-aws/actions/runs/22182930175)


<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_eip.ouchi_relay
  * aws_instance.ouchi_relay
  * aws_key_pair.ouchi_relay
  * aws_s3_bucket_lifecycle_configuration.main[&#34;utb-ouchi-server-tfstate-279586433649&#34;]
  * aws_s3_bucket_lifecycle_configuration.main[&#34;utb-terraform-state-279586433649&#34;]
  * aws_s3_bucket_policy.main[&#34;utb-ouchi-server-tfstate-279586433649&#34;]
  * aws_s3_bucket_policy.main[&#34;utb-terraform-state-279586433649&#34;]
  * aws_security_group.ouchi_relay
  * aws_vpc_security_group_egress_rule.ouchi_relay_all
  * aws_vpc_security_group_ingress_rule.ouchi_relay_ssh


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_eip.ouchi_relay will be created
  + resource "aws_eip" "ouchi_relay" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_instance.ouchi_relay will be created
  + resource "aws_instance" "ouchi_relay" {
      + ami                                  = "ami-04ae19f2563b23082"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ouchi-relay-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "3e68f947e4545192c42cbd858ea3ae0f27e6a2a1"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # aws_key_pair.ouchi_relay will be created
  + resource "aws_key_pair" "ouchi_relay" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ouchi-relay-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDwHudE8GPjz41GOqQSnsEfX4yyhMM19flXAhdKai96WkQCuF/Xh5aeNmZ1wVpbMMYeo4tpvqSFfuiRAKWQTGPGncCTPUEzvy5FcIPnFo9FowfpAofYeoOGe2qQr2EHq9tHqTrdePjTEjrSKT2XMdUpJwIIPNYCwpJFTLfGvAVdISO+HA8OS1XlJyhmBOt1MAq0cf2pciJX9yZmzgBFVE2I/HfiT1wQU2vHt3crV6T+HOz6HDB46+lmxNf2XiI5Ny4XUPAuVo15XxGX99IZONj4O5LoW/5KciJ7pjAmZotO/kVKyaZKZR2yGyEhJ3P0Y8D2peIOPRZicTlpZxAneCXbZwUL4XDMqZd/Zqjwezc6+RNX2T4Q9k+WWykNziUXRlhbFZ3ZMmMp9VEcN+hrDnLIVR5nyeOjkuEqplxWD6G88F5ZMMy2QxCs3a6hdQ48RwqOuOKnZ+QDYYBrFhWN3nMw6vdpyMF9l64XTks2ryrK1U6+rlceYNiDVj827MVCRL0= ouchi-relay"
      + tags            = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all        = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
    }

  # aws_s3_bucket_lifecycle_configuration.main["utb-ouchi-server-tfstate-279586433649"] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = "utb-ouchi-server-tfstate-279586433649"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.main["utb-terraform-state-279586433649"] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = "utb-terraform-state-279586433649"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # aws_s3_bucket_policy.main["utb-ouchi-server-tfstate-279586433649"] will be created
  + resource "aws_s3_bucket_policy" "main" {
      + bucket = "utb-ouchi-server-tfstate-279586433649"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::utb-ouchi-server-tfstate-279586433649",
                          + "arn:aws:s3:::utb-ouchi-server-tfstate-279586433649/*",
                        ]
                      + Sid       = "DenyInsecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_policy.main["utb-terraform-state-279586433649"] will be created
  + resource "aws_s3_bucket_policy" "main" {
      + bucket = "utb-terraform-state-279586433649"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::utb-terraform-state-279586433649",
                          + "arn:aws:s3:::utb-terraform-state-279586433649/*",
                        ]
                      + Sid       = "DenyInsecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_security_group.ouchi_relay will be created
  + resource "aws_security_group" "ouchi_relay" {
      + arn                    = (known after apply)
      + description            = "Security group for ouchi-relay SSH tunnel"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ouchi-relay-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_vpc_security_group_egress_rule.ouchi_relay_all will be created
  + resource "aws_vpc_security_group_egress_rule" "ouchi_relay_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
    }

  # aws_vpc_security_group_ingress_rule.ouchi_relay_ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ouchi_relay_ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "SSH from anywhere"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"    = "ouchi-relay"
          + "Purpose" = "reverse-ssh-tunnel-relay"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "ouchi-relay"
          + "Project"     = "my-cloud-iac-aws"
          + "Purpose"     = "reverse-ssh-tunnel-relay"
          + "Terraform"   = "true"
        }
      + to_port                = 22
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"57450bc942ab6ff1dc7a3b6a70b3919a423bd7d1","Target":"terraform/main","Vars":{},"WorkflowName":"pull_request_target"} -->